DOCFSKDEVII.ИИАнализДокументовOllama/src/InformationRegisters/ИАДО_ЖурналОбращенийКИИ/ИАДО_ЖурналОбращенийКИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИАДО_ЖурналОбращенийКИИ</name>
  <comment>Результаты запросов к модели и ошибки для аудита и диагностики.</comment>
  <resources>
    <name>ВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>HTTPКод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсточникТекстаФайла</name>
    <comment>Регистр текстов версий, извлечение на сервере 1С или пусто.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОтветаКратко</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеталиХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ДокументыПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Уникальный идентификатор записи (строка GUID).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DOCFSKDEVII.ИИАнализДокументовOllama/src/CommonModules/ИАДО_ЖурналИИВызовСервера/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает строку в регистр ИАДО_ЖурналОбращенийКИИ.
//
// Параметры:
//  ПараметрыЗаписи - Структура - обязательные ключи: ВидОперации (Строка), Успешно (Булево), Сообщение (Строка).
//   Необязательные: HTTPКод, ИмяМодели, ИсточникТекстаФайла, ТекстОтветаКратко,
//   Документ, Файл, Детали (произвольное значение для помещения в хранилище).
//
Процедура ДобавитьЗапись(Знач ПараметрыЗаписи) Экспорт

	НаборЗаписей = РегистрыСведений.ИАДО_ЖурналОбращенийКИИ.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	// Универсальные дата/время снижают риск совпадения ключа при пакетных записях и упорядочивание журнала.
	Запись.ДатаВремя = ТекущаяУниверсальнаяДата();
	Запись.Идентификатор = Строка(Новый УникальныйИдентификатор());

	Запись.ВидОперации = Строка(ПараметрыЗаписи.ВидОперации);
	Запись.Успешно = ПараметрыЗаписи.Успешно;
	Запись.Сообщение = Лев(Строка(ПараметрыЗаписи.Сообщение), 1024);

	Запись.HTTPКод = 0;
	Если ПараметрыЗаписи.Свойство("HTTPКод") Тогда
		Запись.HTTPКод = ПараметрыЗаписи.HTTPКод;
	КонецЕсли;

	Запись.ИмяМодели = "";
	Если ПараметрыЗаписи.Свойство("ИмяМодели") Тогда
		Запись.ИмяМодели = Строка(ПараметрыЗаписи.ИмяМодели);
	КонецЕсли;

	Запись.ИсточникТекстаФайла = "";
	Если ПараметрыЗаписи.Свойство("ИсточникТекстаФайла") Тогда
		Запись.ИсточникТекстаФайла = Строка(ПараметрыЗаписи.ИсточникТекстаФайла);
	КонецЕсли;

	Запись.ТекстОтветаКратко = "";
	Если ПараметрыЗаписи.Свойство("ТекстОтветаКратко") Тогда
		Запись.ТекстОтветаКратко = Лев(Строка(ПараметрыЗаписи.ТекстОтветаКратко), 1024);
	КонецЕсли;

	Если ПараметрыЗаписи.Свойство("Документ") Тогда
		Запись.Документ = ПараметрыЗаписи.Документ;
	КонецЕсли;

	Если ПараметрыЗаписи.Свойство("Файл") Тогда
		Запись.Файл = ПараметрыЗаписи.Файл;
	КонецЕсли;

	Попытка
		Запись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Исключение
		Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецПопытки;

	Если ПараметрыЗаписи.Свойство("Детали") И ПараметрыЗаписи.Детали <> Неопределено Тогда
		Запись.ДеталиХранилище = Новый ХранилищеЗначения(ПараметрыЗаписи.Детали);
	КонецЕсли;

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
